# 실수형(float)
# 지수형태

# 4.24 * 10의 3승
a = 4.24E3
b = 4.24 * 1000
print(a)
print(b)

# 10의 5승
x = 100000
y = 1.0E5
z = 10 * 10 * 10 * 10 * 10
print(x, type(x)) # int
print(y, type(y)) # float
print(z, type(z)) # int

# 0.123의 10의 -3승
m1 = 0.123E-3
print(m1) # 0.000123

# 0.123 * 10의 3승
# 지수승을 소문자로 쓸 수 있다.
p1 = 0.123e3
print(p1)

# 부동소숫점의 정밀도(배정도)
f1 = 0.12345678
f2 = 0.123456789
f3 = 0.1234567891
f4 = 0.12345678912
f5 = 0.123456789123
f6 = 0.12345678912345
f7 = 0.1234567891234567890
print(f1)
print(f2)
print(f3)
print(f4)
print(f5)
print(f6)
print(f7)
